src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Роли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Пользователи/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)  
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если не Пользователь = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Наименование;
	НовыйПользователь.ПолноеИмя = Наименование;
	Для Каждого РольВСправочнике из Роли Цикл
		Роль = Метаданные.Роли.Найти(РольВСправочнике.Роль);
		НовыйПользователь.Роли.Добавить(Роль);
	КонецЦикла; 
	НовыйПользователь.Записать();
	Идентификатор = НовыйПользователь.УникальныйИдентификатор;
КонецПроцедуры

Процедура ПередУдалением(Отказ) 
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если не Пользователь = Неопределено Тогда 	
		Пользователь.Удалить();
	КонецЕсли;
КонецПроцедуры
